# 题目：求0—7所能组成的奇数个数。

# 分析：1. 末位必须为1 3 5 7，
# 2. 首位不为0，
# 满足这两个条件即可

# 若数字不可重复：
# 1位数：A4_1 
# 2位数：A4_1 * A6_1 
# i位数：A4_1 * A6_1 * A6_(i-2)

# 若数字可重复：
# 1位数：A4_1 
# 2位数：A4_1 * A7_1 
# i位数：A4_1 * A7_1 * 8^(i-2)


def main():
    """ 数字可重复 """

    num = 8 # 数字个数
    ans = 4 # 结果总和，1位数为4，直接从第2位开始
    cnt = 4 # 第 i 位数中 奇数个数

    for i in range(2, num + 1):
        print(f'{i - 1}位数中有 {cnt} 个奇数')
        if i == 2:
            cnt *= 7
        else:
            cnt *= 8
        ans += cnt
    print(f'合计 {ans} 个奇数')


if __name__ == '__main__':
    main()