# 题目：取一个整数a从右端开始的4〜7位。

#!/usr/bin/python
# -*- coding: UTF-8 -*-
 
if __name__ == '__main__':
    a = int(input('input a number:\n'))
    # a : 9: 0000 1001
    b = a >> 4  # 右移 4 位
    # b : 0000 0000: 0
    c = ~(~0 << 4)
    # ~0 << 4: ~ 的优先级更高
    # ~0: 1111 1111
    # ~0 << 4: 1111 0000
    # c: 0000 1111
    d = b & c
    # b: 0000 0000
    # c: 0000 1111
    # &: 0000 0000
    print ('%o\t%o' %(a,d))

    """ relection """
    # c = ~(~0 << 4)
    # ~0: 可以用这个思路创建一个全 1 位
    # 接着通过 左移 和 按位取反 得到一个 右侧指定数目个1 的二进制码
    # 比直接取手算一个要规范
    